{
  "id": 7872,
  "title": "Max blob flag for local builders",
  "status": "Draft",
  "description": "Adds a flag to the block builder to let operators configure a maximum number of blobs per locally built block. This is an execution-layer–only change.",
  "author": "Francesco D'Amato <francesco.damato@ethereum.org>, Kevaundray Wedderburn (@kevaundray), Toni Wahrstätter (@nerolation), Alex Stokes (@ralexstokes), Ben Adams (@benaadams), Gajinder Singh (@g11tech), Dustin (@tersec)",
  "type": "Standards Track",
  "category": "Core",
  "createdDate": "2025-01-30",
  "discussionLink": "https://ethereum-magicians.org/t/max-blob-flags-for-local-builders/22734",
  "reviewer": "bot",
  "forkRelationships": [
    {
      "forkName": "Glamsterdam",
      "statusHistory": [
        {
          "status": "Proposed"
        }
      ],
      "layer": "EL",
      "champion": {
        "name": "Kevaundray Wedderburn",
        "discord": "kevaundray"
      }
    }
  ],
  "laymanDescription": "Lets node operators set a cap on how many blob-carrying transactions their local builder includes in a block, helping bandwidth-constrained setups avoid overfilling blocks with blobs.",
  "stakeholderImpacts": {
    "endUsers": {
      "description": "No direct UX changes; transaction semantics remain identical. Only block composition may vary by operator settings."
    },
    "appDevs": {
      "description": "No EVM or API changes. Apps sending blob transactions behave the same; inclusion depends on local builder caps."
    },
    "walletDevs": {
      "description": "No transaction format or signing changes. Wallet functionality unaffected by this configuration-only execution change."
    },
    "toolingInfra": {
      "description": "Execution-layer builder tooling should expose and respect a configurable max-blobs parameter. Relays and CL nodes unchanged."
    },
    "layer2s": {
      "description": "No protocol changes. Locally built L1 blocks may include fewer blob transactions when operators configure lower caps."
    },
    "stakersNodes": {
      "description": "Validators running local builders gain a tuning knob aligned with bandwidth. No consensus or fork-choice changes."
    },
    "clClients": {
      "description": "No code changes expected; EL-only behavior. Headers, fork choice, and gossip remain unchanged for consensus clients."
    },
    "elClients": {
      "description": "Add a config flag and enforce it during blob tx selection. Validate against protocol maximum and local cap."
    }
  },
  "benefits": [
    "Gives operators control over blob load.",
    "Mitigates blob availability risks on low bandwidth.",
    "EL-only change with limited surface area.",
    "No changes to transaction or consensus formats."
  ]
}
