{
  "meeting_topic": "All Core Devs - Testing (ACDT) #53 | Sep 22 2025",
  "meeting_start_time": "2025-09-22T13:56:14Z",
  "meeting_end_time": "2025-09-22T14:34:49Z",
  "summary_start_time": "2025-09-22T13:57:22Z",
  "summary_end_time": "2025-09-22T14:34:11Z",
  "summary_created_time": "2025-09-22T13:56:14Z",
  "summary_last_modified_time": "2025-09-22T14:35:33Z",
  "summary_overview": "The team reviewed progress on the Fusaka devnet-5 and discussed various technical challenges including node participation issues and potential bugs in the Nethermind client. They explored the implementation of a 60 million gas limit across different testnets, with concerns raised about Besu's capacity to handle increased block sizes and potential delays to the Fusaka hard fork. The team also discussed scaling issues, gas-imit testing progress, and agreed to make decisions about block size increases by the end of the week, while encouraging attendance at upcoming breakout calls for ePBS and Gloas discussions.",
  "summary_details": [
    {
      "label": "devnet-5 Progress and Challenges",
      "summary": "The team discussed the progress and challenges of the Fusaka devnet-5, including successful BPO numbers and upcoming client tests. They addressed issues with node participation and a potential bug in the Nethermind client, with FLCL and milen providing updates. The team also reviewed the timeline for Holesky and Sepolia tests, and discussed the need for client teams to review and approve a pending PR for shadow forks. Jochem raised concerns about testing gas limits for the XEN contract, and the team explored potential solutions, including seeking help from the Nethermind team."
    },
    {
      "label": "Gas Limit Implementation Discussion",
      "summary": "The team discussed the implementation of a 60 million gas limit across different testnets, with Sepolia and Holesky already supporting this limit. Ameziane reported that while some team members support increasing the gas limit, others are concerned about the risk of delays to the Fuji hard fork. Marius explained that GASP has made improvements to their library for MODEX and switched to GNARC for BN254 operations, confirming their readiness for the 60 million gas limit. The main open question remains about Besu's implementation, with Luis noting that the gas limit increase could potentially delay the Fuji hard fork if issues arise."
    },
    {
      "label": "Besu Scaling and Throughput Challenges",
      "summary": "The team discussed scaling issues, particularly regarding Besu's capacity to handle increased block sizes. Ameziane explained that while there were no issues at 60 million before EEST tests, new use cases showed Besu's throughput at around 15 gas per second, which is below the required 20 mgas per second for 60 million blocks. Barnabas asked if Besu could be scaled down to 55 or 50 million, but Ameziane confirmed that 45 million is the minimum target. Tim raised concerns about the worst-case scenario of implementing Besu at 60 million with potential issues, questioning how long it would take Besu to process a block, to which Ameziane replied that a 60 million block would be processed in approximately 3.5 seconds."
    },
    {
      "label": "Block Size Increase Risk Assessment",
      "summary": "The team discussed potential risks and impacts of increasing the block size to 60 million, particularly focusing on Besu nodes. Ameziane explained that while there might be some performance issues for Besu nodes on standard hardware, the risk of an attack is relatively low. The group agreed to consider the implications further, with Tim suggesting a decision could be made on Thursday. They also discussed the potential benefits of better hardware for processing larger blocks, though Ameziane noted that clock speed would be more important than core count in this case."
    },
    {
      "label": "Gas Testing and Access Updates",
      "summary": "The team discussed progress on gas-imit testing and agreed to make a decision by the end of the week. Toni announced a breakout call on Wednesday to discuss moving from block-level access list hashing. Felipe provided an update on refactoring access checks and adding test cases. Justin reported progress on the spec release for ePBS, which Terence confirmed was ready for consensus testing. The team agreed to rename the breakout call to \"Gloas breakout\" and include both Bals and ePBS teams. Barnabas encouraged attendance at the upcoming ePBS breakout room call on Friday."
    }
  ],
  "next_steps": [
    "Nethermind team to resolve the gas mismatch issue in devnet-3.",
    "Milen to investigate the database commit delays on the Erigon node and follow up with Barnabas offline.",
    "Client teams to aim for code freeze by end of day, with client releases due by Thursday.",
    "Nethermind team to help Jochem with the GP hacked image source code for gas benchmark testing.",
    "Besu team to reach consensus on whether they can support 60 million gas limit and provide an update by the end of the week.",
    "All teams to make a decision about moving to 60 million gas limit by the end of the week.",
    "All interested parties to attend the Block-level Access List breakout call on Wednesday at 2PM UTC.",
    "Justin to complete the ePBS spec release within 24 hours.",
    "Client teams implementing Gloas to attend the ePBS breakout meeting on Friday."
  ]
}