{
  "meeting_topic": "FOCIL Breakout #27, January 27, 2026",
  "meeting_start_time": "2026-01-27T13:56:34Z",
  "meeting_end_time": "2026-01-27T14:09:59Z",
  "summary_start_time": "2026-01-27T13:56:34Z",
  "summary_end_time": "2026-01-27T14:09:55Z",
  "summary_created_time": "2026-01-27T14:10:23Z",
  "summary_last_modified_time": "2026-01-27T15:45:29Z",
  "summary_overview": "Jihoon opened FOCIL Breakout 27 and shared updates on the headline proposal and CL specification plans, though the meeting faced technical difficulties. The team discussed rebasing FOCIL on ePBS, with implementation proposed to occur after Glamsterdam and specification tasks to be completed beforehand. The group agreed to revisit the ePBS integration discussion after the first PBS devnet and consult with other client teams about their approaches.",
  "summary_details": [
    {
      "label": "FOCIL Breakout 27 Technical Issues",
      "summary": "Jihoon welcomed participants to FOCIL Breakout 27 and mentioned that the meeting would be short. He planned to share some updates, but the meeting experienced technical difficulties with lag, which he acknowledged."
    },
    {
      "label": "Headline Proposal and Spec Updates",
      "summary": "Jihoon shared updates on the headline proposal, which is nearly complete, and plans to write a CL specification for Hagota if FOCIL reaches Hagota. He also mentioned the need to update other specs and work on spec tests while others focus on PBS and Glamsterdam EIPs expected around mid-2026. Jihoon asked if there were any questions or development updates to discuss."
    },
    {
      "label": "FOCIL Rebase on ePBS Timeline",
      "summary": "The team discussed rebasing FOCIL on ePBS, with Jihoon suggesting implementation would happen after Glamsterdam and proposed working on specification tasks before the implementation. nflaig agreed that significant progress on FOCIL would not be possible until after a stable ePBS devnet is established, with Jihoon estimating this could be around mid-March. The team decided to revisit the topic after the first PBS devnet and check with other client teams about their approach."
    }
  ],
  "next_steps": [
    "Jihoon: share the headliner proposal soon",
    "Jihoon: write a CL spec for Hagota",
    "Jihoon: update other specs",
    "Jihoon: work on spec tests while others are busy with PBS and Glamsterdam EIPs",
    "Jihoon and team: check in with other client teams around mid-March regarding PBS devnet progress and decide on implementation approach"
  ]
}