{
  "meeting_topic": "All Core Devs - Testing (ACDT) #57, Oct 13, 2025",
  "meeting_start_time": "2025-10-13T13:54:12Z",
  "meeting_end_time": "2025-10-13T14:57:40Z",
  "summary_start_time": "2025-10-13T14:01:41Z",
  "summary_end_time": "2025-10-13T14:57:35Z",
  "summary_created_time": "2025-10-13T13:54:12Z",
  "summary_last_modified_time": "2025-10-13T15:40:25Z",
  "summary_overview": "The team reviewed progress on BPO forks and MEVBoost release updates, including discussions about removing named forks from the schedule and ensuring clients can run with static tests. They examined gas limit testing across multiple Ethereum clients and discussed performance variations, with plans to investigate potential discrepancies further. The conversation ended with extensive discussions about RPC standardization challenges, testing coverage issues, and the need for improved test cases and specifications across Ethereum clients.",
  "summary_details": [
    {
      "label": "BPO Fork and MEVBoost Updates",
      "summary": "The meeting discussed updates on the BPO fork for Holesky and Sepolia, with Barnabas reporting smooth progress and minor participation drops. Bharat shared updates on the new MEVBoost release (VE1.10 Alpha 6), which now supports fallback to the V1 Blinded Blocks API if the V2 API is not supported by relays. The team agreed to remove named forks from the BPO schedule in the genesys.json file, with Barnabas explaining that this is redundant since named forks cannot update values on the CL side after Cancun. The conversation ended with an agreement to make a new release to ensure clients can run with static tests and update the DevNet notes."
    },
    {
      "label": "Gas Limit Testing Progress Review",
      "summary": "The team discussed gas limit testing, with Kamil reporting progress on stateful testing using five major Ethereum clients (Nethermine, Besu, Geth, Erigon, and Reth) on top of BlobTnet. Kamil noted that while performance varied, with Nethermine showing the biggest struggles, the current benchmarks did not fully align with mainnet observations. The team discussed potential reasons for the discrepancy, including caching differences between clients and hardware considerations, with Ameziane offering to help with profiling tools and Mario suggesting further investigation of block preparation and testing scenarios."
    },
    {
      "label": "Ethereum Client Testing and Development",
      "summary": "The team discussed several topics related to Ethereum client development and testing. Kamil requested feedback on stateful scenarios and performance bottlenecks from clients, while Marcin presented findings on transaction failures under different consensus rules. The group reviewed test results for block-level access lists, with Felipe reporting that some test vectors needed fixes but were already merged. They discussed the need for more clients to pass tests before starting a devnet, and Justin provided an update on the delayed DevNet Zero implementation. Finally, Sebastian introduced a discussion on RPC test failures, which he had raised in a recent Ethereum research post."
    },
    {
      "label": "Ethereum RPC Layer Testing Challenges",
      "summary": "Sebastian highlighted critical issues with the Ethereum RPC layer, emphasizing the need for extensive test cases and standardization to ensure the reliability of Ethereum-based applications. He noted that current test coverage is insufficient, with only 190 tests for the entire RPC layer, and highlighted inconsistencies in client implementations, particularly regarding log retrieval. Marius and Łukasz discussed ongoing efforts to address these issues, including proposals for REST-based APIs and improved log indexing, while acknowledging the challenges of prioritizing RPC improvements due to finite developer resources and the need for broader consensus among client teams."
    },
    {
      "label": "RPC Standardization and Testing Challenges",
      "summary": "The team discussed challenges with RPC standardization and testing, with Łukasz highlighting that while Geth serves as a de facto specification, some differences exist between clients that need addressing. Felix clarified that while Geth is used for generating test vectors, the official specs are contained in YAML files, and the team is working on expanding test coverage while being mindful not to overwhelm clients with hundreds of failing tests. The group agreed that client developers need to attend RPC standardization meetings to reach consensus, and Justin Florentine suggested that the process needs to be formalized through an EIP with a dedicated champion."
    },
    {
      "label": "Enhancing RPC Testing Framework",
      "summary": "The team discussed challenges with testing eth_getLogs for large ranges and the need for a testing pipeline to sync multiple clients and conduct fuzz testing. They acknowledged resource constraints due to hardfork season but agreed to prioritize this task. The group decided to continue the discussion in the next RPC call and bring it up in the ACDE meeting. Mario suggested exploring a better specification model, potentially incorporating ideas from EELS into the RPC testing framework to improve test generation."
    }
  ],
  "next_steps": [
    "Client teams to update Sepolia validators to use the new release of MEVBoost  which supports fallback to V1 Blinded Blocks API.",
    "Lighthouse, Besu, and Grandine teams to provide information about stable releases before Hoodi.",
    "Besu team to release a new version for Hoodi and mainnet related to 60 million gas limit this week.",
    "EF team to make a new release to ensure they are not including named forks in the BPO schedule.",
    "Client teams to check the failing tests in the Block-level access list test results and fix any outstanding issues on their side.",
    "Client teams to reach out to Felipe and Raul if there are any unknowns on the Block-level access list tests.",
    "Client teams to continue working on DevNet Zero implementations for EPBS.",
    "Client teams to investigate the RPC test failures and attend the RPC standardization calls to address the issues.",
    "Sebastian and interested parties to join the next RPC call and ACD to continue the discussion on RPC standardization.",
    "Client teams to help Kamil with profiling blocks and suggesting interesting stateful scenarios for gas limit testing."
  ]
}