{
  "meeting_topic": "All Core Devs - Consensus (ACDC) #166, October 2, 2025",
  "meeting_start_time": "2025-10-02T13:55:33Z",
  "meeting_end_time": "2025-10-02T14:46:23Z",
  "summary_start_time": "2025-10-02T13:56:05Z",
  "summary_end_time": "2025-10-02T14:45:53Z",
  "summary_created_time": "2025-10-02T13:55:33Z",
  "summary_last_modified_time": "2025-10-02T16:21:51Z",
  "summary_overview": "The team addressed technical challenges with meeting coordination and discussed updates on testnets including Fusaka and Holesky, with some network issues and participation drops noted during the Holesky fork activation. The group had an extensive discussion about ePBS development, focusing on trustless payments and payload separation, with different opinions expressed about whether to separate these features into distinct proposals. The conversation ended with discussions about process improvements including a champion system for communication, hardware requirements, and naming conventions for H-star.",
  "summary_details": [
    {
      "label": "Zoom Meeting Link Mix-Up",
      "summary": "The team experienced a mix-up with Zoom meeting links, with some participants joining the wrong room. Nixo offered to move to the other meeting and direct attendees to the correct room. Despite the confusion, Stokes decided to proceed with the meeting once enough participants had joined the correct room. Josh confirmed he was helping with the stream, and Stokes began to review the agenda for ACDC meeting number 166."
    },
    {
      "label": "Testnet Updates and Network Behavior",
      "summary": "The team discussed updates on the Fusaka and Holesky testnets. Parithosh reported that nonfinality was tested on the Fusaka Devnet 3, which was successfully healed after two days. The Holesky fork activation was generally successful, though there were some participation drops and unexplained network behavior that was attributed to missing updates. The team scheduled a meeting to discuss the upcoming VPO on Monday, and Ameziane noted a significant drop in network activity on Holesky validators after the fork, which the team agreed to investigate further. Stokes also mentioned a PR for a PeerDAS readiness document that includes a set of metrics and a process for readiness documentation."
    },
    {
      "label": "ePBS Development and Payment Systems",
      "summary": "The team discussed the status of ePBS development, with Potuz reporting no changes to the specs but noting ongoing discussions about payment systems and their implementation. The group agreed to be more careful about merging production code rather than using hacky branches, following issues with PeerDAS, and decided to wait for a more stable version of the Fusaka branch before proceeding with ePBS. Lin presented a quick overview of trustless payments in ePBS, though the details of this presentation were not captured in the transcript."
    },
    {
      "label": "ePBS Trusted Payments Discussion",
      "summary": "The discussion focused on the separation of trusted business payments in ePBS, which introduces two key changes: payload separation and process payments. Lin proposed either keeping trusted payments within the current EIP or creating a separate EIP to discuss these features independently, as they have different stakeholders and levels of complexity. The conversation highlighted the need for further discussion on the impact of trustless payments on the ecosystem, including potential challenges for builders and staking protocols."
    },
    {
      "label": "Trustless Payments in ePBS Proposal",
      "summary": "The team discussed whether to include trustless payments in the ePBS proposal, with Lin expressing concerns about potential bypassing of in-protocol justice payments and advocating for separation due to controversy in the ecosystem. Ansgar supported splitting the proposal into two parts, citing historical context where ePBS morphed from focusing on trustless payments to scalability, and suggested making the decision separately from the headliner EIP. The group agreed that a decision should not be made immediately, as many people are likely strongly opposed to separating the headliner EIP into two parts."
    },
    {
      "label": "Separating PBS Features Discussion",
      "summary": "The meeting focused on the discussion of separating payload blocks operation and proposer-builder separation into two distinct features, with Greg from Lido agreeing that this would be a leaner approach. Potuz emphasized that trustless payments are easier to implement with the current ePBS specification, and the group discussed the potential removal of MEV-boost support. Ansgar suggested that the conversation about unconditional payments should happen offline, and Lin raised questions about bypassibility with trustless payments. The group agreed that further research and discussion are needed before making any decisions."
    },
    {
      "label": "Glamsterdam Process and Design Decisions",
      "summary": "The team discussed the Glamorous process of Glamsterdam, focusing on design decisions, and the need for a written document outlining trade-offs. They agreed to keep the conversation moving, with next steps including an upcoming ePBS breakout and a decision on the headliner split in two weeks. The team also refined the process for non-headliner EIPs, setting a deadline for proposals after the mainnet date is set. Additionally, they addressed a proposal for a champion system to improve communication, simplified the language, and agreed to move forward with it. The conversation ended with discussions on hardware requirements and naming conventions for H-star, with a suggestion to use the popular option \"Etios.\""
    }
  ],
  "next_steps": [
    "Core developers to continue monitoring Holesky after the fork activation, particularly the participation rate fluctuations.",
    "Parithosh to generate and share bandwidth analysis report clustered per client by tomorrow.",
    "Stokes to continue working on the PR for Fusaka readiness documentation and process.",
    "Core developers to prepare for the first VPO  scheduled in a few days.",
    "Core developers to create a written document outlining the trade-offs between payload separation and trustless payments in ePBS to drive further discussion.",
    "Interested parties to join the ePBS breakout call next Friday to discuss the potential separation of payload separation and trustless payments.",
    "Wolovim's PR about specifying a primary point of contact for EIPs to be merged within 24 hours.",
    "Core developers to move EIP 7870  from interview to live status.",
    "Community members to provide input on H-star naming in the ETH Magicians thread, with \"Etios\" currently being the most popular option."
  ]
}